ExchangePlans/DMS_ОбменСАвтосалоном.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<ExchangePlan>
		<Properties>
			<Name>DMS_ОбменСАвтосалоном</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтборПоДилерам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОтборПоПредставителям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилаОбмена</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилаОбменаКорреспондента</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВыгрузкиПриНеобходимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_РежимыВыгрузкиОбъектовОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Представители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Представитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.DMS_Представители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДилерскиеЦентры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДилерскийЦентр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

InformationRegisters/DMS_СоответствияОбъектовИнформационныхБаз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>DMS_СоответствияОбъектовИнформационныхБаз</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УникальныйИдентификаторИсточникаСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗначенияСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сопоставлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.DMS_ОбменСАвтосалоном</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификаторИсточника</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеПриемника</Name>
					<Type>
						<v8:TypeSet>cfg:BusinessProcessRoutePointRef</v8:TypeSet>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ExchangePlans/DMS_ОбменСАвтосалоном/Forms/ФормаУзла/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.СтраницаПравилаОбмена.Видимость = Ложь;
	КонецЕсли; 
	
	УзелОбъект = РеквизитФормыВЗначение("Объект");
	
	ПравилаОбмена 				= УзелОбъект.ПравилаОбмена.Получить();	
	ПравилаОбменаКорреспондента = УзелОбъект.ПравилаОбменаКорреспондента.Получить();	
	
	ИспользоватьТиповоеПравилоОбмена 			   = ?(ПравилаОбмена = Неопределено,0,1);
	ИспользоватьТиповоеПравилоОбменаКорреспондента = ?(ПравилаОбменаКорреспондента = Неопределено,0,1);
	
	УзелОбъект = Неопределено;
	
	УстановитьВидимость();	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Код = Объект.Код;
	
	Элементы.СтраницаПравилаОбмена.Видимость = Истина;
	
	ЭтотУзел = Объект.Ссылка = ПланыОбмена.DMS_ОбменСАвтосалоном.ЭтотУзел();
	
	УстановитьЗаголовокСоответствияОбъектов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ Объект.ИспользоватьОтборПоПредставителям И Объект.Представители.Количество() <> 0 Тогда
		Объект.Представители.Очистить();
	ИначеЕсли Объект.ИспользоватьОтборПоПредставителям И Объект.Представители.Количество() = 0 Тогда
		Объект.ИспользоватьОтборПоПредставителям = Ложь;
	КонецЕсли;
	
	Если НЕ Объект.ИспользоватьОтборПоДилерам И Объект.ДилерскиеЦентры.Количество() <> 0 Тогда
		Объект.ДилерскиеЦентры.Очистить();
	ИначеЕсли Объект.ИспользоватьОтборПоДилерам И Объект.ДилерскиеЦентры.Количество() = 0 Тогда
		Объект.ИспользоватьОтборПоДилерам = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ИспользоватьТиповоеПравилоОбмена = 0 Тогда
		ТекущийОбъект.ПравилаОбмена = Новый ХранилищеЗначения(Неопределено,Новый СжатиеДанных(9));
	Иначе 
		ТекущийОбъект.ПравилаОбмена = Новый ХранилищеЗначения(МакетПравилаОбмена,Новый СжатиеДанных(9));
	КонецЕсли; 
	
	Если ИспользоватьТиповоеПравилоОбменаКорреспондента = 0 Тогда
		ТекущийОбъект.ПравилаОбменаКорреспондента = Новый ХранилищеЗначения(Неопределено,Новый СжатиеДанных(9));
	Иначе 
		ТекущийОбъект.ПравилаОбменаКорреспондента = Новый ХранилищеЗначения(МакетПравилаОбменаКорреспондента,Новый СжатиеДанных(9));
	КонецЕсли; 
	
КонецПроцедуры
 
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Элементы.СтраницаПравилаОбмена.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СоответствиеОбъектов(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
	
		Сообщить("Узел необходимо записать!");
		Возврат;
	
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура("Отбор",Новый Структура("Сопоставлен,УзелИнформационнойБазы",Ложь,Объект.Ссылка));
	
	ОткрытьФорму("РегистрСведений.DMS_СоответствияОбъектовИнформационныхБаз.Форма.ФормаСписка",ПараметрыФормы,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПравилаОбмена(Команда)
	
	Если ИспользоватьТиповоеПравилоОбмена = 0 Тогда
		                        
		МакетПравилаОбмена = ПолучитьТиповойМакетУзла("ПравилаОбмена");
		                        
	Иначе 
		
		Режим = РежимДиалогаВыбораФайла.Открытие;
		
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
		
		ДиалогОткрытияФайла.ПолноеИмяФайла  = "";
		Фильтр = "Правило обмена(*,xml)|*.xml";
		ДиалогОткрытияФайла.Фильтр = Фильтр;
		ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
		ДиалогОткрытияФайла.Заголовок   = "Выберите правило обмена";
		
		Если ДиалогОткрытияФайла.Выбрать() Тогда
			
			ПутьКФайлу = ДиалогОткрытияФайла.ПолноеИмяФайла;
			
			Файл = Новый Файл(ПутьКФайлу);
			
			Если Файл.Существует() Тогда
				
				ЧтениеТекста = Новый ЧтениеТекста;
				ЧтениеТекста.Открыть(ПутьКФайлу, КодировкаТекста.UTF8);
				
				Результат = ЧтениеТекста.Прочитать();
				
				МакетПравилаОбмена.Очистить();
				МакетПравилаОбмена.УстановитьТекст(Результат);
				
				ЧтениеТекста.Закрыть();	
				
			КонецЕсли; 
			
		КонецЕсли	
		
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПравилаОбменаКорреспондента(Команда)
	
	Если ИспользоватьТиповоеПравилоОбменаКорреспондента = 0 Тогда
		                        
		МакетПравилаОбменаКорреспондента = ПолучитьТиповойМакетУзла("ПравилаОбменаКорреспондента");
		                        
	Иначе 
		
		Режим = РежимДиалогаВыбораФайла.Открытие;
		
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
		
		ДиалогОткрытияФайла.ПолноеИмяФайла  = "";
		Фильтр = "Правило обмена(*,xml)|*.xml";
		ДиалогОткрытияФайла.Фильтр = Фильтр;
		ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
		ДиалогОткрытияФайла.Заголовок   = "Выберите правило обмена корреспондента";
		
		Если ДиалогОткрытияФайла.Выбрать() Тогда
			
			ПутьКФайлу = ДиалогОткрытияФайла.ПолноеИмяФайла;
			
			Файл = Новый Файл(ПутьКФайлу);
			
			Если Файл.Существует() Тогда
				
				ЧтениеТекста = Новый ЧтениеТекста;
				ЧтениеТекста.Открыть(ПутьКФайлу, КодировкаТекста.UTF8);
				
				Результат = ЧтениеТекста.Прочитать();
				
				МакетПравилаОбменаКорреспондента.Очистить();
				МакетПравилаОбменаКорреспондента.УстановитьТекст(Результат);
				
				ЧтениеТекста.Закрыть();	
				
			КонецЕсли; 
			
		КонецЕсли	
		
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура КодПриИзменении(Элемент)
	Объект.Код = Код;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборПоПредставителямПриИзменении(Элемент)
	УстановитьВидимость();	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборПоДилерамПриИзменении(Элемент)
	УстановитьВидимость();	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватТиповойПриИзменении(Элемент)
	
	ТекстВопроса = ?(ИспользоватьТиповоеПравилоОбмена = 0,"Загрузить типовое правило?","Загрузить правило из файла?");
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Ответ = Вопрос(ТекстВопроса, Режим, 0);
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		ИспользоватьТиповоеПравилоОбмена = ?(ИспользоватьТиповоеПравилоОбмена = 0,1,0);
		Возврат;
	КонецЕсли;
	
	ЗагрузитьПравилаОбмена(Неопределено);	
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватТиповоеПравилоОбменаКорреспондентаПриИзменении(Элемент)
	
	ТекстВопроса = ?(ИспользоватьТиповоеПравилоОбменаКорреспондента = 0,"Загрузить типовое правило?","Загрузить правило из файла?");
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Ответ = Вопрос(ТекстВопроса, Режим, 0);
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		ИспользоватьТиповоеПравилоОбменаКорреспондента = ?(ИспользоватьТиповоеПравилоОбменаКорреспондента = 0,1,0);
		Возврат;
	КонецЕсли;
	
	ЗагрузитьПравилаОбменаКорреспондента(Неопределено);	
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()

	Элементы.ГруппаПредставители.Видимость = Объект.ИспользоватьОтборПоПредставителям И Не ЭтотУзел;	
	Элементы.ГруппаДилерскиеЦентры.Видимость = Объект.ИспользоватьОтборПоДилерам И Не ЭтотУзел;	
	                             
	Элементы.СтраницаПравилаОбмена.Видимость = Не ЭтотУзел;
	
КонецПроцедуры // УстановитьВидимость()

&НаСервереБезКонтекста
Функция ПолучитьТиповойМакетУзла(ИмяМакета)

	Возврат ПланыОбмена.DMS_ОбменСАвтосалоном.ПолучитьМакет(ИмяМакета);

КонецФункции // ПолучитьТиповойМакетУзла()

&НаСервере
Процедура УстановитьЗаголовокСоответствияОбъектов()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЭтотУзел", Объект.Ссылка);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СоответствияОбъектов.УникальныйИдентификаторИсточника) КАК КоличествоЗаписей
		|ИЗ
		|	РегистрСведений.DMS_СоответствияОбъектовИнформационныхБаз КАК СоответствияОбъектов
		|ГДЕ
		|	СоответствияОбъектов.УзелИнформационнойБазы = &ЭтотУзел
		|	И НЕ СоответствияОбъектов.Сопоставлен";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	КоличествоЗаписей = 0;
	
	Если Выборка.Следующий() Тогда
		КоличествоЗаписей = Выборка.КоличествоЗаписей;	
	КонецЕсли; 
	
	Элементы.ФормаСоответствиеОбъектов.Заголовок = "Соответствие объектов ["+Формат(КоличествоЗаписей,"ЧЦ=10; ЧН=0; ЧГ=")+"]";
	
КонецПроцедуры // УстановитьЗаголовокСоответствияОбъектов()
